[
    {
      "from": "May 2020",
      "to": "Act.",
      "what": "Software Developer",
      "where": "Santander T&O",
      "url": "https://www.bancosantander.es/",
      "experience": [
        "Developed advanced scripts of control models and validation of sensitive data of the entire Leasing & Renting department with Pyspark used by the operatives in decision making.",
        "Design and development of highly interactive applications with Python, C# and Shell connected to Hive SQL.",
        "Making of multiples Web Scrapping solutions with Selenium that include the Spain Tax Agency and different internal pages of the bank for various departments."
      ]
    },
    {
      "from": "Sep 2020",
      "to": "Sep 2021",
      "what": "Mental Illness Predictor",
      "where": "Oberta University of Catalunya",
      "url": "https://www.uoc.edu/portal/es/index.html",
      "experience": [
        "Master's thesis where a tool was created to predict mental illness from the gut microbiome in humans.",
        "Creation of a REST API architecture with Django in charge of the logic to train Machine Learning models from the microbiomes, connected to a PostgreSQL database.",
        "Design and development of a highly interactive interface with Reactjs connected to the backend."
      ]
    },
    {
      "from": "May 2019",
      "to": "Jan 2020",
      "what": "Software developer",
      "where": "Acerta I+D+i",
      "url": "https://acerta-cert.com/sobre-idi/",
      "experience": [
        "Process of qualification and certification R+D of projects of the Information Technology (IT) sector."
      ]
    },
    {
      "from": "Sep 2017",
      "to": "Sep 2018",
      "what": "Bioinformatics",
      "where": "CSIC",
      "url": "https://www.csic.es/es",
      "experience": [
        "Study of the behavior of aquaporins before different post-harvest conservation treatments at the Spanish Superior Council of Scientific Investigations.",
        "Design and development of a Python solution for qPCR data normalization and maintenance in PostgreSQL.",
        "Created mathematical and statistical models in R for presentation of study results."
      ]
    }
  ]
  